import React from "react";
import { Collapse } from "antd";

const items = [
  {
    key: "1",
    label: "آيا یادگیری CSS سخت است؟",
    children: (
      <p>
        خیر! یادگیری CSS بسیار ساده‌است، اما تنها نیاز به تمرین و تکرار و کسب
        مهارت در استفاده کردن از ویژگی‌های مختلف این زبان را دارد. شما با دوره
        آموزش رایگان CSS در وبسایت راکت به شکل قدم به قدم می‌توانید CSS را به
        صورت بسیار ساده یاد بگیرید.
      </p>
    ),
  },
  {
    key: "2",
    label: "آیا برای طراحی وب، یادگیری CSS الزامی است؟",
    children: (
      <p>
        جواب این سوال قطعا بله است. این امکان پذیر نیست که شما تصمیم بگیرید
        طراحی وب انجام دهید اما CSS را یاد نگیرید. در واقع CSS دومین تکنولوژی
        مهم در توسعه و طراحی صفحات وب بعد از HTML است و در نتیجه حتما باید آن را
        یاد بگیرید.{" "}
      </p>
    ),
  },
  {
    key: "3",
    label: "در این دوره چقدر با CSS آشنا می‌شویم؟",
    children: (
      <p>
        شما با استفاده از دوره‌ آموزش CSS وبسایت راکت می‌توانید تقریبا بر ۹۰
        درصد از مباحث موجود CSS تسلط پیدا کنید البته این تسلط تنها با تمرین و
        تکرار در کنار مشاهده جلسات دوره به دست می‌آید.
      </p>
    ),
  },
  {
    key: "4",
    label: "در این دوره چقدر با CSS آشنا می‌شویم؟",
    children: (
      <p>
        شما با استفاده از دوره‌ آموزش CSS وبسایت راکت می‌توانید تقریبا بر ۹۰
        درصد از مباحث موجود CSS تسلط پیدا کنید البته این تسلط تنها با تمرین و
        تکرار در کنار مشاهده جلسات دوره به دست می‌آید.
      </p>
    ),
  },
];
const App = () => {
  const onChange = (key) => {};
  return (
    <div className="mt-10">
      <Collapse items={items} defaultActiveKey={["1"]} onChange={onChange} />
    </div>
  );
};
export default App;
