import React from "react";

const index = () => {
  return (
    <div className="w-[80%] h-[650px] mt-10 mx-auto bg-white rounded-lg shadow-2xl">
      <div className="w-[90%]  mx-auto relative top-10">
        <h1 className="text-2xl text-blue-800"> توضیحات </h1>
        <h2 className="text-xl text-gray-600 mt-5">
          CSS یا Cascading Style Sheets یک زبان برنامه‌نویسی نیست!‌ پس چیست؟
          باید گفت CSS یک زبان استایل‌نویسی‌ست که با استفاده از آن ‌می‌توانید
          وبسایت‌های با ظاهر فوق‌ العاده ایجاد کنید. ما در دوره آموزش CSS سعی
          داریم که CSS را به شکل ساده و قدم به قدم و به شکل کامل به شما آموزش
          دهیم.
        </h2>

        <h2 className="text-xl text-gray-600 mt-5">
          یادگیری CSS بسیار ساده‌ است و تنها نیاز به کمی حوصله و تمرین دارد. در
          ادامه این مطلب کمی در مورد این دوره و خود بحث CSS صحبت خواهیم کرد.
        </h2>

        <h2 className="text-xl text-gray-600 mt-5">
          اگر اسکلت بدن انسان را HTML در نظر بگیریم، CSS را می‌توان گوشت، پوست و
          مو در نظر گرفت که به ظاهر انسان شکل می‌دهد. این ساده‌ترین تعریفی است
          که می‌توان از CSS ارائه کرد. بدونه شک یادگیری طراحی وب بدون یادگیری
          CSS یک عمل امکان ناپذیر است. بنابراین خواه یا ناخواه اگر مایل هستید به
          یک برنامه‌نویس Front-End تبدیل شوید باید CSS را یاد بگیرید.
        </h2>

        <h2 className="text-xl text-gray-600 mt-5">
          استایل دادن به فونت‌ها و متن‌ها در ظاهر یک وبسایت به شدت تاثیرگذار و
          کاربردی است. در این بخش به شکل کامل در مورد روش اعمال استایل‌های CSS
          بر روی متن‌ها، موارد مختلفی را به شما آموزش خواهیم داد. صفحه‌نمایش‌های
          با اندازه‌های مختلف امروزه جز جدایی ناپذیر زندگی ما شده‌اند از
          موبایل‌ها گرفته تا تبلت و لپ تاپ که هر کدام در هر مدل دارای سایز صفحه
          نمایش متفاوت هستند. اگر شما وبسایتی را طراحی کنید و با CSS به آن
          استایل دهید اما به رسپانسیو بودن صفحه‌هات خود نسبت به این صفحه
          نمایش‌ها بی توجه باشید عملا وبسایتی بسیار بد را بوجود آوردید. که تنها
          در یک ابزار با صفحه نمایش خاص ظاهر مناسبی دارد. در این بخش از دوره
          آموزش CSS ما سعی کردیم در مورد رسپانسیو کردن وبسایت در پروژه‌های واقعی
          صحبت کنیم و آن را به شما آموزش دهیم.
        </h2>
      </div>
    </div>
  );
};

export default index;
